benchmarks/server-2/raw_results.txt
==== Run 1 ====
command: siege -c 5 -b -r 3200
uptime: 21:54:07 up 161 days, 3:11, 1 user, load average: 0.00, 0.00, 0.00
** SIEGE 2.66
** Preparing 5 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      437.49 secs
Data transferred:	      560.49 MB
Response time:		        0.14 secs
Transaction rate:	       36.57 trans/sec
Throughput:		        1.28 MB/sec
Concurrency:		        5.00
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        1.88
Shortest transaction:	        0.00
 

real	7m17.509s
user	0m0.968s
sys	0m2.724s

==== Run 2 ====
command: siege -c 10 -b -r 1600
uptime: 22:01:24 up 161 days, 3:18, 2 users, load average: 0.17, 0.09, 0.02
** SIEGE 2.66
** Preparing 10 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      451.91 secs
Data transferred:	      560.49 MB
Response time:		        0.28 secs
Transaction rate:	       35.41 trans/sec
Throughput:		        1.24 MB/sec
Concurrency:		        9.99
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        4.03
Shortest transaction:	        0.00
 

real	7m31.918s
user	0m0.776s
sys	0m2.128s

==== Run 3 ====
command: siege -c 20 -b -r 800
uptime: 22:08:56 up 161 days, 3:26, 2 users, load average: 0.15, 0.11, 0.05
** SIEGE 2.66
** Preparing 20 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      449.84 secs
Data transferred:	      560.49 MB
Response time:		        0.56 secs
Transaction rate:	       35.57 trans/sec
Throughput:		        1.25 MB/sec
Concurrency:		       19.98
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        8.02
Shortest transaction:	        0.00
 

real	7m29.858s
user	0m1.232s
sys	0m3.664s

==== Run 4 ====
command: siege -c 100 -b -r 320
uptime: 22:16:26 up 161 days, 3:33, 2 users, load average: 0.03, 0.09, 0.08
** SIEGE 2.66
** Preparing 100 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       32000 hits
Availability:		      100.00 %
Elapsed time:		     1015.19 secs
Data transferred:	     1120.99 MB
Response time:		        3.16 secs
Transaction rate:	       31.52 trans/sec
Throughput:		        1.10 MB/sec
Concurrency:		       99.63
Successful transactions:       32000
Failed transactions:	           0
Longest transaction:	       52.35
Shortest transaction:	        0.00
 

real	16m55.214s
user	0m1.888s
sys	0m5.692s