benchmarks/server-2/raw_results.txt
==== Run 1 ====
command: siege -c 5 -b -r 3200
uptime: 17:28:43 up 160 days, 22:45, 2 users, load average: 0.02, 0.03, 0.00
** SIEGE 2.66
** Preparing 5 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      964.07 secs
Data transferred:	     1233.86 MB
Response time:		        0.30 secs
Transaction rate:	       16.60 trans/sec
Throughput:		        1.28 MB/sec
Concurrency:		        4.99
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        2.18
Shortest transaction:	        0.00
 

real	16m4.083s
user	0m0.540s
sys	0m1.744s

==== Run 2 ====
command: siege -c 10 -b -r 1600
uptime: 17:44:47 up 160 days, 23:01, 2 users, load average: 0.00, 0.00, 0.00
** SIEGE 2.66
** Preparing 10 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      989.94 secs
Data transferred:	     1233.86 MB
Response time:		        0.62 secs
Transaction rate:	       16.16 trans/sec
Throughput:		        1.25 MB/sec
Concurrency:		        9.99
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        4.52
Shortest transaction:	        0.00
 

real	16m29.976s
user	0m0.800s
sys	0m2.624s

==== Run 3 ====
command: siege -c 20 -b -r 800
uptime: 18:01:17 up 160 days, 23:18, 2 users, load average: 0.00, 0.03, 0.02
** SIEGE 2.66
** Preparing 20 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       16000 hits
Availability:		      100.00 %
Elapsed time:		      997.85 secs
Data transferred:	     1233.86 MB
Response time:		        1.25 secs
Transaction rate:	       16.03 trans/sec
Throughput:		        1.24 MB/sec
Concurrency:		       19.99
Successful transactions:       16000
Failed transactions:	           0
Longest transaction:	        8.98
Shortest transaction:	        0.02
 

real	16m37.885s
user	0m0.808s
sys	0m2.472s

==== Run 4 ====
command: siege -c 100 -b -r 320
uptime: 18:17:55 up 160 days, 23:35, 2 users, load average: 0.04, 0.07, 0.02
** SIEGE 2.66
** Preparing 100 concurrent users for battle.
The server is now under siege...      done.
Transactions:		       32000 hits
Availability:		      100.00 %
Elapsed time:		     1968.20 secs
Data transferred:	     2467.72 MB
Response time:		        6.13 secs
Transaction rate:	       16.26 trans/sec
Throughput:		        1.25 MB/sec
Concurrency:		       99.64
Successful transactions:       32000
Failed transactions:	           0
Longest transaction:	       80.88
Shortest transaction:	        0.00
 

real	32m48.208s
user	0m1.896s
sys	0m5.520s